<a href="https://codeimmersives.com"><img src = "https://www.codeimmersives.com/wp-content/uploads/2019/09/CodeImmersives_Logo_RGB_NYC_BW.png" width = 400> </a>


<h1 align=center><font size = 5>Agenda</font></h1>

### 
<div class="alert alert-block alert-info" style="margin-top: 20px">

1.  [Review](#0)<br>
2.  [Dataframes continued](#2)<br>
2.  [DF's Exercise](#10)<br> 
3.  [Statistics/Pickle Exercise](#12)<br>     
</div>
<hr>

<h2> Exercise </h2>
1) Edit the states dataframe to create a new dataframe frame2 that adds a 'debt' column  <br> 
2) change the indices to be string numbers from one to six ('one', ... 'six) <br>
3) Print all the values in the years column for viewing <br>
4) Print row 'three' with all it's values using loc[] <br>
5) Use numpy's arange() function to fill the debt column frame2['debt'] with a range of numbers (Hint: you need to match the range to the number of rows in the frame for broadcasting to work).

Solution

In [6]:
dataset = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [8]:
import numpy as np
import pandas as pd

frame2 = pd.DataFrame(dataset, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four',
                             'five', 'six'])
frame2['debt'] = np.arange(6)
frame2

# df.series gives single column as series
frame2.year 
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt        2
Name: three, dtype: object

Now instead of an arange, say we wanted to specify the debt column manually ourselves, we can do this by creating another series and assigning the series to the dataframe (remember how dataframes contain series).

In [9]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
# frame2['debt'] = val   Alternate way of assigning series to column
frame2.debt = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [21]:
frame2['Eastern'] = frame2.state == 'Ohio'
frame2
#del frame2['Eastern']

       year   state  pop  debt  Eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

<h2> Exercise </h2>
1) Add a western state column that reads True for western states. <br> 
2) Print the resulting table. <br>
3) Add an Eastern_Debt column that is populated with a random number from 0 to 100. Print the result. <br>
4) delete all western and eastern columns using del

Solution

In [22]:
# 1) Add a western state column that reads True for western states.

frame2['Western'] = frame2.state == 'Nevada'

In [23]:
# 2) Print the resulting table.

frame2

       year   state  pop  debt  Eastern  Western
one    2000    Ohio  1.5   NaN     True    False
two    2001    Ohio  1.7  -1.2     True    False
three  2002    Ohio  3.6   NaN     True    False
four   2001  Nevada  2.4  -1.5    False     True
five   2002  Nevada  2.9  -1.7    False     True
six    2003  Nevada  3.2   NaN    False     True

In [25]:
# 3) Add an Eastern_Debt column that is populated with a random number from 0 to 100 only in for the Eastern States. Print the result.

frame2['Eastern_Debt'] = [np.random.randint(0,100) if x == True else 0 for x in frame2['Eastern']]
frame2

       year   state  pop  debt  Eastern  Western  Eastern_Debt
one    2000    Ohio  1.5   NaN     True    False            22
two    2001    Ohio  1.7  -1.2     True    False            25
three  2002    Ohio  3.6   NaN     True    False            30
four   2001  Nevada  2.4  -1.5    False     True             0
five   2002  Nevada  2.9  -1.7    False     True             0
six    2003  Nevada  3.2   NaN    False     True             0

In [18]:
# 4) delete all western and eastern columns using del

del frame2['Eastern_Debt']
del frame2['Eastern']
del frame2['Western']

frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

<h4> Transposing </h4>

In [29]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [30]:
frame3 = pd.DataFrame(pop)
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [31]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [32]:
pd.DataFrame(pop, index=[2001, 2002, 2003]) #pd.DataFrame[data, columns, indices]

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [33]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [34]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
pd.DataFrame(pdata)

      Ohio  Nevada
2001   1.7     2.4
2002   3.6     2.9

In [ ]:
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [35]:
frame3['Nevada'].values

array([2.4, 2.9, nan])

In [36]:
frame2.values

array([[2000, 'Ohio', 1.5, nan, True, False, 22],
       [2001, 'Ohio', 1.7, -1.2, True, False, 25],
       [2002, 'Ohio', 3.6, nan, True, False, 30],
       [2001, 'Nevada', 2.4, -1.5, False, True, 0],
       [2002, 'Nevada', 2.9, -1.7, False, True, 0],
       [2003, 'Nevada', 3.2, nan, False, True, 0]], dtype=object)

### Correlation and Covariance

conda install pandas-datareader

In [2]:
import pandas as pd

# Read the pickle files
price = pd.read_pickle('yahoo_price.pkl')
volume = pd.read_pickle('yahoo_volume.pkl')

# Dataframe of price and volume
df_price = pd.DataFrame(price)
df_volume = pd.DataFrame(volume)

In [10]:
# How to get the mnonth of April for price
    # the first one is row, the second one is column

df_price.iloc[61:82, 2:3]

                   IBM
Date
2010-04-01  110.202345
2010-04-05  111.147556
2010-04-06  110.786648
2010-04-07  110.399975
2010-04-08  109.652408
2010-04-09  110.640572
2010-04-12  110.296866
2010-04-13  110.872581
2010-04-14  112.780178
2010-04-15  112.470838
2010-04-16  112.247430
2010-04-19  113.622266
2010-04-20  111.439707
2010-04-21  110.838215
2010-04-22  110.958514
2010-04-23  111.697493
2010-04-26  112.333350
2010-04-27  110.692140
2010-04-28  111.792014
2010-04-29  112.101354
2010-04-30  110.846803

In [11]:
df_price.head(19)

                 AAPL        GOOG         IBM       MSFT
Date
2010-01-04  27.990226  313.062468  113.304536  25.884104
2010-01-05  28.038618  311.683844  111.935822  25.892466
2010-01-06  27.592626  303.826685  111.208683  25.733566
2010-01-07  27.541619  296.753749  110.823732  25.465944
2010-01-08  27.724725  300.709808  111.935822  25.641571
2010-01-11  27.480148  300.255255  110.763844  25.315406
2010-01-12  27.167562  294.945572  111.644958  25.148142
2010-01-13  27.550775  293.252243  111.405433  25.382312
2010-01-14  27.391211  294.630868  113.184773  25.892466
2010-01-15  26.933449  289.710772  112.731385  25.808835
2010-01-19  28.124939  293.516976  114.750251  26.009552
2010-01-20  27.692027  289.915587  111.422546  25.583028
2010-01-21  27.213337  291.199286  110.353231  25.097963
2010-01-22  25.863592  274.730736  107.359151  24.219826
2010-01-25  26.559391  269.730740  107.889534  24.520902
2010-01-26  26.934757  270.939526  107.573014  24.671439
2010-01-27  27.188489  270.779695  108.069178  24.813614
2010-01-28  26.065007  266.878565  105.862111  24.387091
2010-01-29  25.119401  264.705742  104.698697  23.567497

In [70]:
df_volume.head(19)

                 AAPL      GOOG       IBM       MSFT
Date
2010-01-04  123432400   3927000   6155300   38409100
2010-01-05  150476200   6031900   6841400   49749600
2010-01-06  138040000   7987100   5605300   58182400
2010-01-07  119282800  12876600   5840600   50559700
2010-01-08  111902700   9483900   4197200   51197400
2010-01-11  115557400  14479800   5730400   68754700
2010-01-12  148614900   9742900   8081500   65912100
2010-01-13  151473000  13041800   6455400   51863500
2010-01-14  108223500   8511900   7111800   63228100
2010-01-15  148516900  10909600   8494400   79913200
2010-01-19  182501900   8665700  13916200   46575700
2010-01-20  153038200   6525700  15197500   54849500
2010-01-21  152038600  12662600   9608600   73086700
2010-01-22  220441900  13651700  10088600  102004600
2010-01-25  266424900   8872800   5738500   63373000
2010-01-26  466777500   8743600   7135300   66639900
2010-01-27  430642100   7958400   8719200   63949500
2010-01-28  293375600   6482300   9622200  117513700
2010-01-29  311488100   8311900  11571200  193888500

<code>
import pandas_datareader.data as web <br>

all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']} <br>

price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})<br>
                     
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})
<code>

In [43]:
returns = df_price.pct_change()
returns

                AAPL      GOOG       IBM      MSFT
Date
2010-01-04       NaN       NaN       NaN       NaN
2010-01-05  0.001729 -0.004404 -0.012080  0.000323
2010-01-06 -0.015906 -0.025209 -0.006496 -0.006137
2010-01-07 -0.001849 -0.023280 -0.003462 -0.010400
2010-01-08  0.006648  0.013331  0.010035  0.006897
...              ...       ...       ...       ...
2016-10-17 -0.000680  0.001837  0.002072 -0.003483
2016-10-18 -0.000681  0.019616 -0.026168  0.007690
2016-10-19 -0.002979  0.007846  0.003583 -0.002255
2016-10-20 -0.000512 -0.005652  0.001719 -0.004867
2016-10-21 -0.003930  0.003011 -0.012474  0.042096

[1714 rows x 4 columns]

In [44]:
#returns['MSFT'].corr(returns['IBM'])
returns['MSFT'].cov(returns['IBM'])

8.870655479703546e-05

In [45]:
returns.MSFT.corr(returns.IBM)

0.49976361144151155

In [47]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.407919  0.386817  0.389695
GOOG  0.407919  1.000000  0.405099  0.465919
IBM   0.386817  0.405099  1.000000  0.499764
MSFT  0.389695  0.465919  0.499764  1.000000

In [49]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000277  0.000107  0.000078  0.000095
GOOG  0.000107  0.000251  0.000078  0.000108
IBM   0.000078  0.000078  0.000146  0.000089
MSFT  0.000095  0.000108  0.000089  0.000215

In [ ]:
returns.corrwith(returns.IBM)

AAPL    0.386817
GOOG    0.405099
IBM     1.000000
MSFT    0.499764
dtype: float64

In [ ]:
returns.corrwith(volume)

AAPL   -0.075565
GOOG   -0.007067
IBM    -0.204849
MSFT   -0.092950
dtype: float64

# Exercise
Taking the two dataframes for price and volume, calculate the day to day change in total sales (price x volume) for each day.

In [66]:
# Set new df variables for price and volume
price_df = pd.DataFrame(price)
volume_df = pd.DataFrame(volume)

# Calculate the day-to-day change in total sales
daily_sales_change = (price_df * volume_df).pct_change()

daily_sales_change

                AAPL       GOOG       IBM      MSFT
Date
2010-01-04       NaN        NaN       NaN       NaN
2010-01-05  0.221206   0.529243  0.098038  0.295674
2010-01-06 -0.097237   0.290763 -0.186002  0.162328
2010-01-07 -0.137480   0.574644  0.038371 -0.140051
2010-01-08 -0.055634  -0.253659 -0.274164  0.019596
...              ...        ...       ...       ...
2016-10-17 -0.337801   0.282459  0.354367 -0.133400
2016-10-18  0.038599   0.867597  1.111303 -0.190233
2016-10-19 -0.186474  -0.941113 -0.635922  0.192032
2016-10-20  0.203590  13.789009 -0.130131  1.151151
2016-10-21 -0.075809  -0.270963  0.080508  0.685164

[1714 rows x 4 columns]

This notebook is part of a course at www.codeimmersives.com called Data Science. If you accessed this notebook outside the course, you can get more information about this course online by clicking here.

<hr>

Copyright &copy; 2021  Code Immersives